export default {
  projections: {
    ЗаказыE: {
      кодЗаказа: {
        __caption__: 'Код заказа'
      },
      дата: {
        __caption__: 'Дата'
      },
      типОплаты: {
        __caption__: 'Тип оплаты'
      },
      типВручения: {
        __caption__: 'Тип вручения'
      },
      колво: {
        __caption__: 'Колво'
      },
      комментарий: {
        __caption__: 'Комментарий'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      заказТапочек: {
        __caption__: 'Заказ тапочек',
        комментарий: {
          __caption__: 'Комментарий'
        }
      },
      заказСланцев: {
        __caption__: 'Заказ сланцев',
        комментарий: {
          __caption__: 'Комментарий'
        }
      }
    },
    ЗаказыL: {
      кодЗаказа: {
        __caption__: 'Код заказа'
      },
      дата: {
        __caption__: 'Дата'
      },
      типОплаты: {
        __caption__: 'Тип оплаты'
      },
      типВручения: {
        __caption__: 'Тип вручения'
      },
      колво: {
        __caption__: 'Колво'
      },
      комментарий: {
        __caption__: 'Комментарий'
      },
      сумма: {
        __caption__: 'Сумма'
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    кодЗаказа: {
      __caption__: 'Код заказа'
    },
    колво: {
      __caption__: 'Колво'
    },
    комментарий: {
      __caption__: 'Комментарий'
    },
    сумма: {
      __caption__: 'Сумма'
    },
    типВручения: {
      __caption__: 'Тип вручения'
    },
    типОплаты: {
      __caption__: 'Тип оплаты'
    },
    адрес: {
      __caption__: 'адрес'
    },
    клиенты: {
      __caption__: 'клиенты'
    },
    сотрудник: {
      __caption__: 'сотрудник'
    },
    заказСланцев: {
      __caption__: 'Заказ сланцев'
    },
    заказТапочек: {
      __caption__: 'Заказ тапочек'
    }
  }
};
